app/views/users/show.html.erb

SELECT COUNT(*) FROM `microposts` WHERE `microposts`.`user_id` = 101
---
    <%= render 'follow_form' if signed_in? %>
    <% if @user.microposts.any? %>