app/controllers/microposts_controller.rb

  def create
  @micropost = current_user.microposts.build(params[:micropost])
    if @micropost.save
---
INSERT INTO `microposts` (`content`, `created_at`, `updated_at`, `user_id`) VALUES ('hiiiiiiiiiii', '2013-01-30 07:30:49', '2013-01-30 07:30:49', 1)

  def destroy
    @micropost.destroy
---
DELETE FROM `microposts` WHERE `microposts`.`id` = 303