app/controllers/users_controller.rb

  def show
    @user = User.find(params[:id])
    @microposts = @user.microposts.paginate(page: params[:page])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT COUNT(*) FROM `microposts` WHERE `microposts`.`user_id` = 101
SELECT `microposts`.* FROM `microposts` WHERE `microposts`.`user_id` = 101 ORDER BY microposts.created_at DESC LIMIT 30 OFFSET 0

  def create
    @user  = User.new(params[:user])

    if @user.save
---
INSERT INTO `users` (`admin`, `created_at`, `email`, `name`, `password_digest`, `remember_token`, `updated_at`) VALUES (NULL, '2013-01-25 13:43:39', 'sonukumar9897@gmail.com', 'Sonu Kumar', '$2a$10$E9IlBCvvWi0PucqggHcwLuzrk7oPIvcGUzbgHEZtPlySCPUOP3.tW', '4ZDCwJq32ASbyIV49A5ZbA', '2013-01-25 13:43:39')

  def update
    @user = User.find(params[:id])
    if @user.update_attributes(params[:user])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 10 LIMIT 1
UPDATE `users` SET `name` = 'Vikas Kumar', `password_digest` = '$2a$10$jziu9lLAZ3R9XvEc9d3iK.Kl/6NVKf7VhMN0dfmFiyK36BmS9x6nu', `remember_token` = 'IPF0c03qRp79HSP8K0LLZg', `updated_at` = '2013-01-24 06:39:25' WHERE `users`.`id` = 10

  def following
    @title = "Following"
    @user = User.find(params[:id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1

  def followers
    @title = "Followers"
    @user = User.find(params[:id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1